# ── Homebrew Extensions ──────────────────
tap "homebrew/bundle"
tap "homebrew/services"

# ── Shell & navigation ───────────────────
brew "dotter"
brew "zsh"
brew "fzf"            # fuzzy finder
brew "zoxide"         # smart cd with frequency
brew "fd"             # fast find

# ── Modern CLI replacements ──────────────
brew "topgrade"
brew "starship"
brew "ripgrep"
brew "bottom"
brew "git"

# ── Dev tools ────────────────────────────
brew "gh"             # GitHub CLI

# ── Runtimes ─────────────────────────────
brew "uv"
brew "ruff"
brew "duckdb"
brew "bun"
brew "rustup"
brew "biome"

# ── Applications ─────────────────────────
# cask "zed"
# cask "ghostty"
# cask "beekeeper-studio"

# cask "localsend"

# cask "proton-pass"
# cask "telegram"
# cask "discord"
